local words = {
	-- 请将新的内容写在上面
	"v1.103",
	"升级界面按住CTRL键点击属性可以返还未确认的升级点",
	"新增两个可升级的属性，额外幸运和攻速倍率",
	"优化了熔炉战矛和暗影战矛的伤害机制",
	"取消了闪电战矛的额外攻击距离",
	"修复了生成旗鱼水剑崩溃的bug",
	"修复了生成滑行手杖崩溃的bug",
	"击杀所有史诗级怪物都会掉落生命精华",
	"史诗级怪物包括世界boss，树精和蜘蛛女王",
	"座狼和钢羊与大象一样只属于大型生物",
	"锯齿领主血量改为1250，并且死后才会召唤另外两个",
	"部分物品更换名称",
}

local data = {
	{
		"v1.103",
		"修复了没有捆绑物资时制造运输火箭崩溃的bug",
		"风之战矛改为速度战矛，不再拥有熔炉武器加成",
		"速度战矛配方改为：长矛x1，绳子x1，树枝x1，仙人掌肉x1",
		"进行了一些优化",
	},
	{
		"v1.101",
		"四级boss拥有图标",
		"修复了九牛二猪的召唤bug",
		"人工降雨改为无科技可建造",
		"新增 运输火箭，建造后会将捆绑物资空投到玩家所在地",
		"如果捆绑物资放在容器里则无法空投",
		"v1.102",
		"修复了制造 魔法书目录 时的bug",
		"新增 翼翅镰刀，拿着镰刀可以快速采集资源",
		"击杀龙蝇有几率掉落 囚嘤笼蓝图",
		"四季boss冰雕蓝图改为几率掉落",
	},
	{
		"v1.100",
		"猪王草人附近的幻影墙壁现在可以看见了",
		"boss冰雕改为击杀boss后掉落蓝图解锁",
		"狗牙陷阱的使用次数提升到20",
		"蓝鸟的蛋可以使用，使用后将会让蓝鸟变身",
		"海妖的血量改为2000（暴毙难度为3000）",
		"修复了'充值商城'购买物品时的bug",
		"修理光粉可以修复部分专属护甲和头盔",
		"优化了一些范围伤害的目标选择",
	},
	{
		"v1.100",
		"更新了七件装备，请在合成图鉴中查看",
		"击杀boss时会掉落藏宝图，有几率掉落鲁珀特之泪",
		"蓝色合金的合成材料改为两个蓝宝石和两个金块",
		"赏金猎人、牦牛杀手、亚空间不享受熔炉伤害加成",
	},
	{
		"v1.099",
		"大锅鸟改为蓝鸟（原存档中的大锅鸟不会被替换掉），",
		"蓝鸟兼容了 整租烹饪(Cook Stack Food) mod",
		"新增蓝鸟的蛋，蓝鸟的蛋会吸引来蓝鸟，类似眼骨",
		"蓝鸟的蛋会刷在岩石地皮，可在搜索世界中检索数量",
		"现在威尔逊的蛋不可制作",
		"新增红龙的背包，红龙背包会吸引来红龙，类似眼骨",
		"红龙拥有16格容器，但会被视为怪物",
		"杀死坎普斯有几率掉落红龙背包，红龙背包只会掉落一次",
		"搜索世界ui更改",
	},
	{	
		"v1.099",
		"巨人国地下的猴子也有几率变成黄金猿",
		"黄金猿掉落锻造台蓝图的几率改为5%",
		"威尔逊的木筏改为威尔逊的睡莲，合成配方也有所变化",
		"突刺类战矛突刺时的每段伤害增加为34点",
		"boss短剑可以在战争熔炉炼制，详情请查看合成图鉴",
		"修理粉末的修理效果降低",
		"皮弗娄牛装上草帽鞍后拥有9格容器",
		"现在训牛的成本和时间大幅降低",
		"v1.098",
		"黄金猿会有1%的几率掉落锻造台蓝图",
		"游戏内会显示版本号",
		"水草，红树，芦苇，荧光果的种植需要在制药台制作魔法根茎",
	},
	{
		"v1.097",
		"暗影雕像取消，潘多拉魔盒改为月圆期间打开会产生影怪",
		"新增物品修理粉末，使用后能够增加专属装备的40次耐久",
		"v1.096",
		"现在威尔逊可以种植荧光果了",
		"新增采收卷轴，使用后可以采收周围的作物",
		"修复了精灵草帽的bug",
		"新增暗影雕像，暗影雕像会在月圆期间不断召唤影怪",
		"v1.095",
		"现在威尔逊可以种植芦苇了",
	},
	{
		"v1.094",
		"修复了战争熔炉的动画bug",
		"v1.093",
		"现在座狼只会在暴毙模式下给猎狗加buff",
		"增加了攻击宝石座狼掉落宝石的概率",
		"v1.091",
		"现在击杀假骑士掉落萌新礼包",
		"现在击杀灵魂学徒掉落威尔逊的火腿",
		"威尔逊的火腿战技的伤害范围增加",
		"v1.090",
		"新增灌溉土丘，可以在灌溉土丘上种植作物",
		"灌溉土丘需要蓝图解锁，蓝图可从萌新礼包获取",
		"萌新礼包增加新选项‘灌溉桶’，选择可获得灌溉土丘蓝图",
	},
	{
		"v1.089",
		"新增物品藏宝图，可以挖宝",
		"击杀boss有几率掉落藏宝图",
		"海难猴子有几率变成黄金猿，击杀黄金猿会掉落藏宝图",
		"黄金猿可以通过颜色和名字辨认，检查时也会有所区别",
		"现在科学家模式下制造装甲船也会可以获得船装备",
		"装甲船建造时会自带一个船炮和布帆",
	},
	{
		"v1.088",
		"新增两种头盔和三种护甲，相关信息请查看合成图鉴",
		"新增四种药剂，相关信息请查看合成图鉴",
		"现在头盔的制造转移到战争熔炉处，",
		"请勿在绘图台制作头盔",
		"新增远古之冠，戴上后对4000生命上限以上的生物造成伤害时，",
		"会造成目标5%最大生命值的额外伤害，",
		"以减轻玩家在对付后期怪物时的压力",
		"铥矿套装的伤害吸收削弱到80%",
		"新增暗影卷轴，使用后可以召唤威尔逊之影",
		"修复了猪人卷轴和兔人卷轴不会被消耗的bug",
		"充值商城可以购买更多物品了",
	},
	{
		"v1.087",
		"现在月之领主（野猪王）不会在创造世界时生成，",
		"而是在月圆的时候会降临到猪王身边",
		"新增了一些建筑，boss冰雕（并没有什么实际用途）",
		"新增了猪人卷轴和兔人卷轴，相关信息请查看合成图鉴",
		"现在可以批量合成了（武器锻造台除外）",
		"若你与生命树人交易时处于中毒状态，那么生命树人会改为为你解毒",
		"新增充值商城，用户可以在商城消费呼噜币，降低玩家后期的资源压力",
		"充值商城需要20级以后解锁",
		"现在升级界面会显示玩家当前的等级",
	},
	{
		"v1.086",
		"新增三种头盔，可以在绘图台制作，相关信息请查看合成图鉴",
		"治愈头盔，鲜血战矛和复苏护甲属于套装，凑齐后会缓慢回血",
		"温暖头盔，火焰战矛和烈火护甲属于套装，凑齐后会提供保暖效果",
		"清凉头盔，冰霜战矛和寒冰护甲属于套装，凑齐后会提供降温效果",
		"新增囚嘤笼，由萌新礼包开出蓝图解锁，喂养后有几率掉落宝石",
		"现在击杀boss会由几率掉落萌新礼包",
		"治愈头盔的额外回复效果对与其同套装的其他装备是不生效的",
	},
	{
		"v1.085",
		"新增几种护甲，可以在战争熔炉炼制，相关信息请查看合成图鉴",
		"新增几种药剂，可以在制药台合成，相关信息请查看合成图鉴",
	},
	{
		"v1.084",
		"野猪王更名为月之领主，月之领主的体型会随昼夜变化",
		"新增三位护法，月之领主会一次召唤六位护法",
		"护法的血量上调为600，新增六位元素领主（我野猪王一人分饰七角）",
		"猩红领主：100%吸血，每失去1%的血量，提高10%的攻击力",
		"雷霆领主：拥有远程攻击，近战攻击它时会触电",
		"烈焰领主：拥有掉血光环，攻击和被攻击时会点燃目标",
		"冰霜领主：拥有降温光环，攻击和被攻击时会冰冻目标",
		"沼泽领主：攻击和被攻击时会令目标中毒，对中毒目标造成额外伤害",
		"幻影领主：会召唤一个分身，分身是无敌的，本体死亡时分身消失",
		"元素领主都拥有诅咒光环，并会召唤相同元素的六位护法",
		"元素领主死亡时会掉落大量生命精华",
		"元素领主将会在月圆时在猪王附近出现，如果有其他领主存活则不会出现",
	},
	{
		"v1.084",
		"猪王日记不再可合成，现在打败所有元素领主之后，",
		"月圆时，猪王旁边将会出现猪王日记",
		"猪王日记的理智消耗降低，猪王日记召唤的猪人跟随时间拉满",
		"自然之力第4年及以后增加的血量为基础血量的10%",
		"搜索世界第二页里可以搜索元素领主的数量",
	},
	{
		"v1.084",
		"新增制药台，制药台可以炼制药剂，配方详见合成图鉴",
		"黄色元素之力的火焰攻击改为攻击后拥有3秒的无敌时间",
		"沉睡的伪骑士在玩家靠近时便会苏醒",
		"座狼拥有狼王之力，基础血量提高到1000",
		"座狼的嚎叫会给周围的猎犬提供buff",
		"buff效果为攻击，移速，防御，回复的加成，每次一种",
		"新增boss灵魂学徒，会在地图上出现",
		"灵魂学徒会使用能量球攻击敌人并召唤幽灵",
		"灵魂学徒的攻击会增加玩家的诅咒值",
		"如果敌人靠近灵魂学徒，灵魂学徒会闪烁拉开距离",
		"血量较低时，灵魂学徒被攻击时会释放冲击波",
		"击杀灵魂学徒后会掉落萌新礼包",
	},
	{
		"v1.084",
		"加入月光湖，月光湖会出现在地图之中，被幻影墙壁所隔开",
		"月圆之夜玩家戴上潜水镜跳进池塘，便可进入月光湖",
		"此时驻守在月光湖的愚者蜘蛛便会出现在玩家身边",
		"愚者蜘蛛一开始或者血量降低一定程度后便会召唤白蜘蛛",
		"愚者蜘蛛的攻击将增加玩家的诅咒值",
		"愚者蜘蛛会释放冲击波对玩家进行攻击",
		"愚者蜘蛛死后，月光湖的幻影墙壁便会消失",
		"击杀愚者蜘蛛会掉落制药台蓝图",
		"野猪王现在也是由幻影墙壁隔离",
		"但野猪王身边的幻影墙壁在月圆时会消失",
	},
	{
		"v1.083",
		"新增boss锯齿领主，会在地图上出现",
		"锯齿领主善用冲天刺和突刺进行战斗",
		"锯齿领主的攻击将会对玩家造成重伤效果",
		"重伤效果持续期间，玩家的血量回复将会减半",
		"锯齿领主在血量较低时，会召唤她的另外两个姐妹加入战斗",
		"击杀锯齿领主将会掉落武器锻造台的蓝图",
		"现在天启骑士不再掉落武器锻造台的蓝图",
		"请不要轻易去挑战锯齿领主",
		"巨人的诅咒将在70天之后产生，产生的几率下降",
		"诅咒解除的时间增加到70天",
	},
	{
		"v1.083",
		"新增boss小黄蜂，会在地图上出现",
		"小黄蜂的攻击有几率对玩家造成流血效果",
		"流血效果期间，玩家会持续扣减生命值",
		"小黄蜂在攻击敌人后，会迅速滑铲远离敌人",
		"小黄蜂在滑铲的过程中会处于无敌状态，前后摇没有",
		"小黄蜂的血量较低时，会变为远程攻击，并且滑铲速度更快",
		"击杀小黄蜂会掉落滑行手杖，滑行手杖现已不可制造",
		"击杀世界boss也有几率掉落滑行手杖",
	},
	{
		"v1.083",
		"自然之力降临，玩家外的所有生物每过一年便会提升生命上限",
		"每次提升的生命上限等于基础生命上限的50%",
		"这一改变并非实时发生的",
		"伪骑士降临，代替战争熔炉旁边的4位主教（需要新档）",
		"伪骑士在血量大于90%时，拥有80%的伤害减免",
		"伪骑士的攻击将会对玩家造成破甲效果",
		"破甲效果持续时间内，玩家装备的护甲收益降低一半",
		"威尔逊的火腿可以用大肉交互，消耗一块大肉的新鲜度，",
		"来回复威尔逊的火腿等量的新鲜度（新鲜度越高，小肉掉率越高）",
		"威尔逊的火腿不再可制造，杀死伪骑士掉落或世界boss随机掉落",
		"天启骑士降临不再可制作，天启骑士现由遥远的呼唤召唤",
		"现在击杀牦牛时有几率掉落遥远的呼唤",
	},
	{
		"合成图鉴界面会有物品介绍",
		"新增世界搜索图标，点开可以检查世界资源的完整性",
		"可以用探测杖对生命古树和战争熔炉进行搜索",
		"生命古树现在不再提供升级，升级界面作为图标出现在右上角",
		"现在可以拿银杏树叶给予给生命古树，",
		"生命古树会随机给予银杏树苗，战争树苗，哨兵树苗，生命树苗",
		"战争树苗和哨兵树苗不可制造",
		"生命古树现在不再会和战争熔炉刷在一起",
		"生命古树会刷在地图上的常青树林里",
		"生命之树现在回调，不会再长成生命古树",
		-- "",
	},
	{
		"《更新公告》和《合成图鉴》作为图标出现在右上角",
		"《更新公告》和《合成图鉴》不再可制作",
		"取消潘多拉魔盒，新增武器锻造台",
		"原本世界内的潘多拉魔盒会被武器锻造台取代（已取消）",
		"武器锻造台可以用三个近战手持武器锻造一个融合战矛，",
		"融合战矛会继承用来融合的三种武器的效果，",
		"一些手持的拥有伤害属性的工具也可以用来融合，",
		"提灯、火炬以及本mod的专属物品不能用于融合",
		"现在威尔逊出生自带《更新公告》和《合成说明书》(已取消)",
		"武器锻造台需要蓝图解锁，杀死天启骑士解锁蓝图",
		"天启骑士的法阵不再秒杀玩家，会让玩家的诅咒值增加50点",
		"戴上牛帽或牦牛背包，天启骑士的法阵就不会增加诅咒值",
		"关于诅咒值：诅咒值满之后玩家会暴毙，诅咒值平时会不断下降",
	},
	{
		"新增竞技战矛",
		"新增风之战矛，攻击后会获得一定时间的移速加成",
		"新增大地战矛，攻击时会释放冲击波",
		"新增闪电战矛，攻击时有几率召唤闪电击中敌人，",
		"但闪电也有一定几率击中自己，请做好防雷准备",
		"新增闪耀战矛，闪耀战矛装备后会一直发光并掉落耐久，",
		"攻击敌人会增加闪耀战矛的耐久值",
		"风之战矛，闪电战矛，闪耀战矛享受熔炉武器额外伤害加成",
		"落木之息改为远程，攻击方式为指挥树叶进行攻击",
		"森林之枪可以装填椰果，椰果子弹对近距离的敌人会造成更多",
		"伤害，且有几率召唤暗影触手对敌人进行攻击",
	},
	{
		"等级系统重做上线",
		"现在生命精华不再可食用",
		"新增生命古树，右键生命古树可进行升级",
		"生命树苗不可制造，生命之树最大形态下会变成生命古树",
		"生命古树，战争熔炉和猪王草人会在新地图中生成",
		"点击升级界面中的图标提升对应的属性",
		"属性在原版威尔逊数值以下时，一级提升五点，否则提升一点",
		"可以点击的次数等于你的物品栏里拥有的生命精华数量",
		"在升级界面点击确定则会根据提升的属性消耗等量的生命精华",
		"现在击杀boss会获得更多的生命精华",
		"旧版本玩家会根据提升的等级返还相应属性的生命精华，",
		"并给予30个银杏树叶和一个生命树种",
	},
	{
		"野猪王不再掉落萌新礼包，改为掉落绘图台蓝图",
		"与猪王草人交易不再能够获得绘图台和潘多拉魔盒的蓝图",
		"野猪王会在月圆期间逃出生天",
		"以下内容需要在新档中才能生成：",
		"银杏树苗和生命树苗不再能够制作，桦树林里会生成银杏树",
		"地图中会出现一个特殊区域，",
		"此区域会出现战争熔炉，生命古树和四个主教",
		"囚禁野猪王的孤岛中会生成一个猪王草人",
		"猪王村会生成一个潘多拉魔盒",
		"萌新礼包给予的物品更换为沃格斯塔夫的三个礼物",
		"月圆时跳进青蛙池塘会进入虚空海域，小心蜘蛛",
	},
	{
		"野猪王的能力得到了加强",
		"野猪王在白天，黄昏，夜晚和满月时会发生属性变化，",
		"白天最低，黄昏属性会变高，夜晚更高，满月最高",
		"靠近野猪王将会使玩家的诅咒值上涨",
		"诅咒值满之后玩家就会暴毙",
		"诅咒值平时会自然降低",
		"困难模式更名暴毙模式",
		"冰蟹背包的合成材料改为兔蟹",
		"森林之枪的子弹特效进行了更新",
		"科学家形态会有10%的加速",
		"会获得熔炉武器伤害加强的有：火矛、冰矛、毒矛、血矛、",
		"远古短剑、旗鱼水剑、巨鹿短剑、鹿鸭短剑、龙蝇短剑、熊獾短剑",
	},
	{
		"所有的专属装备都在战争熔炉里炼制",
		"猪王路线会新增物品绘图台",
		"所有的背包和卷轴都在绘图台制作",
		"巨人的诅咒将在简单模式下取消",
		"猪王，影灯，方尖碑和石虾的修改在简单模式下取消",
		"池塘可燃烧的修改取消",
		"猪王草人可以兑换金子",
		"与猪王草人交易到一定次数会获得专属蓝图",
		"第一次与猪王草人交易得到绘图台蓝图",
		"传送卷轴会传送到猪王草人身边",
		"合成说明书里可以看到合成所需要的的工作台和材料",
	},
	{
		"现在森林之枪可以同时装填4种树果",
		"不同的树果会有不同的效果",
		"松果会让森林之枪拥有更远的攻击距离",
		"橡果子弹会造成范围伤害",
		"丛林树果子弹击中敌人会回复你的生命值",
		"茶树果子弹击中敌人后会令敌人昏睡",
	},
	{
		"猪人们获得了元素之力",
		"红色：造成伤害时回复等量的体力值，并额外造成伤害值一半的额外伤害",
		"蓝色：攻击距离增加",
		"粉色：攻击时会召唤暗影触手",
		"黄色：攻击会点燃目标",
		"青色：攻击会冰冻目标",
		"绿色：攻击会令目标中毒",
		"困难模式下，更多的生物获得元素之力",
		"困难模式下，除玩家外的生物无法以BOSS作为攻击目标",
	},
}

local function SentenceClass()
	local a_class = {
		sentences = {},
		add_page = function(t)
			-- t.sentences[#t.sentences+1] = {}
			table.insert(t.sentences, {})
		end,
		add_sentence = function(t, sentence)
			local n = #t.sentences[#t.sentences]
			if n >= 13 then
				t:add_page()
			end
			table.insert(t.sentences[#t.sentences], sentence)
		end,
		get_max_page = function(t)
			return #t.sentences
		end,
		get_sentences = function(t, page)
			return t.sentences[page]
		end,
	}
	return a_class
end

local sentence_manager = SentenceClass()
sentence_manager:add_page()
for k, v in pairs(words) do
	sentence_manager:add_sentence(v)
end
for k, v in pairs(data) do
	sentence_manager:add_page()
	for k2, v2 in pairs(v) do
		sentence_manager:add_sentence(v2)
	end
end

local function UpdatePanelDataClass()
	local a_class = {
		title = "更新公告",
		cur_page = 1,
		max_page = 1,
		sentence_manager = SentenceClass(),
		get_sentence = function(t)
			local sentences = sentence_manager:get_sentences(t.cur_page)
			local sentence = ""
			for k,v in pairs(sentences) do
				sentence = sentence..v.."\n"
				-- if k <= #sentences then
				-- 	sentence = sentence.."\n"
				-- end
			end
			return sentence
		end,
		get_title = function(t)
			return t.title
		end,
		page_turn = function(t, dt)
			t.cur_page = math.min(t.max_page, math.max(1, t.cur_page+dt))
		end,
	}
	return a_class
end

local update_panel_data = UpdatePanelDataClass()
update_panel_data.sentence_manager = sentence_manager
update_panel_data.max_page = sentence_manager:get_max_page()
GLOBAL.WARGON.DATA.update_panel_data = update_panel_data